{
 //Template
  {
   "name":"",
   "style":"Oriental",
   "leaderName":"",
   "adjectives":["Japanese"],
   "startBias":[""],
   "preferredVictoryType":"",

   "startIntroPart1":"",
   "startIntroPart2":"",

   "introduction":"",
   "neutralHello":"",
   "hateHello":"",
   "tradeRequest":"",

   "declaringWar":"",
   "attacked":"",
   "defeated":"",

   "outerColor":[0,0,0],
   "innerColor":[0,0,0],

   "uniqueName":"",
   "uniques":[""],
   "cities":[],
},
{
   "name":"",
   "style":"Oriental",
   "cityStateType":"",
   "adjective":["Japanese"],
   "declaringWar":"",
   "attacked":"",
   "defeated":"",
   "outerColor":[0,0,0],
   "innerColor":[0,0,0],
   "uniques":[""],
   "cities":[""],
},
//Major Clans
{
   "name":"Oda",
   "style":"Oriental",
   "leaderName":"Oda Nobunaga",
   "adjectives":["Japanese"],
   "startBias":["Hill"],
   "preferredVictoryType":"Domination",

   "startIntroPart1":"Blessings upon you noble Oda Nobunaga, ruler of the land where the sun rises - may you long walk among its flowering blossoms. You are the ruler of Japan, the land of the Rising Sun. The Japanese are an island people, proud and pious with a rich culture of arts and letters. Your civilization stretches back thousands of years, years of bloody warfare, expansion and isolation, great wealth and great poverty. In addition to their prowess on the field of battle, your people are also immensely industrious, and their technological innovation and mighty factories are the envy of lesser people everywhere.",
   "startIntroPart2":"Legendary daimyo, will you grab the reins of destiny? Will you bring your family and people honor and glory? Will you once again pick up the sword and shield and march to triumph? Can you build a civilization that will stand the test of time?",

   "introduction":"Welcome, I am the humble Oda Nobunaga. We hope for a fair and just relationship with you, who are renowned for military bravery.",
   "neutralHello":"Greetings, what brings you to me here?",
   "hateHello":"Oh, it's you...",
   "tradeRequest":"I, the humble Oda Nobunaga, would be grateful if you agreed on this proposal.",

   "declaringWar":"I hereby inform you of our intention to wipe out your clan from this world.",
   "attacked":"Pitiful fool! Now we shall destroy you!",
   "defeated":"You were much wiser than I thought.",

   "outerColor":[120,120,0],
   "innerColor":[0,0,0],

   "uniqueName":"The Way of Bushido",
   "uniques":["Units fight as though they were at full strength even when damaged. +1 Culture from each Fishing Boat and +2 Culture from each Atoll."],
   "cities":["Nagoya","Kiyosu","Komakiyama","Gifu","Azuchi"],
},
{
   "name":"Tokugawa",
   "style":"Oriental",
   "leaderName":"Tokugawa Ieyasu",
   "adjectives":["Japanese"],
   "startBias":["None"],
   "preferredVictoryType":"Domination",

   "startIntroPart1":"Great Daimyō Tokugawa Ieyasu, you know well that the patient blade is the one that will strike home. Guard your homeland carefully from usurpers domestic and foreign, and trust in the industry and resourcefulness of your people, for they alone can be relied upon. The task of rule is one that is long, and its burdens are heavy, but there is no room for discontent, nor for despair, with your hand upon the sword.",
   "startIntroPart2":"Oh great daimyō, will you battle until your last breath? Will you ",

   "introduction":"I am the humble Tokugawa Ieyasu, the head of the Tokugawa clan. Without my say, nothing happens.",
   "neutralHello":"",
   "hateHello":"",
   "tradeRequest":"",

   "declaringWar":"The sharp-edged sword cuts through the void, and within the raging fire, a cool wind blows.",
   "attacked":"Watch out and be aware of my soldiers! I'll wait for the right moment to strike at you.",
   "defeated":"The summer grasses are all that remains of warriors' dreams.",

   "outerColor":[150,150,0],
   "innerColor":[0,0,0],

   "uniqueName":"",
   "uniques":[""],
   "cities":[],
}
//Minor Clans
//Ikko-ikki
//Others
