[
//Major Clans
{
              "name":"Oda",
   "style":"Oriental",
   "leaderName":"Oda Nobunaga",
   "adjectives":["Oda Clan Member"],
   "startBias":["Hill"],
   "preferredVictoryType":"Domination",
   "favoredReligion":"Shinto",

   "startIntroPart1":"Blessings upon you noble Oda Nobunaga, ruler of the land where the sun rises - may you long walk among its flowering blossoms. You are the ruler of Japan, the land of the Rising Sun. The Japanese are an island people, proud and pious with a rich culture of arts and letters. Your civilization stretches back thousands of years, years of bloody warfare, expansion and isolation, great wealth and great poverty. In addition to their prowess on the field of battle, your people are also immensely industrious, and their technological innovation and mighty factories are the envy of lesser people everywhere.",
   "startIntroPart2":"Legendary daimyo, will you grab the reins of destiny? Will you bring your family and people honor and glory? Will you once again pick up the sword and shield and march to triumph? Can you build a civilization that will stand the test of time?",

   "introduction":"Welcome, this humble one is Oda Nobunaga. We hope for a fair and just relationship with you, who are renowned for military bravery.",
   "neutralHello":"Greetings, what brings you here?",
   "hateHello":"Oh, it's you...",
   "tradeRequest":"I, Oda Nobunaga, would be grateful if you agreed on this proposal.",

   "declaringWar":"I hereby inform you of our intention to wipe out your clan from this world.",
   "attacked":"Pitiful fool! Now we shall destroy you!",
   "defeated":"You were much wiser than I thought.",

   "outerColor":[220,220,0],
   "innerColor":[0,0,0],

   "uniqueName":"The Way of Bushido",
   "uniques":["Units fight as though they were at full strength even when damaged. [+1 Culture] from each [Fishing Boat] and [+2 Culture] from each [Atoll]."],
   "cities":["Nagoya","Kiyosu","Komakiyama","Gifu","Azuchi","Kyoto","Osaka"],
},
{
               "name":"Tokugawa",
   "style":"Oriental",
   "leaderName":"Tokugawa Ieyasu",
   "adjectives":["Tokugawa Clan Member"],
   "startBias":["None"],
   "preferredVictoryType":"Domination",
   "favoredReligion":"Buddhism",

   "startIntroPart1":"Great Daimyō Tokugawa Ieyasu, you know well that the patient blade is the one that will strike home. Guard your homeland carefully from usurpers domestic and foreign, and trust in the industry and resourcefulness of your people, for they alone can be relied upon. The task of rule is one that is long, and its burdens are heavy, but there is no room for discontent, nor for despair, with your hand upon the sword.",
   "startIntroPart2":"Oh great daimyō, will you battle until your last breath? Will you ",

   "introduction":"This humble one is Tokugawa Ieyasu, the head of the Tokugawa clan. Without my say, nothing happens.",
   "neutralHello":"Ah, nice to see you again. What brings you here?",
   "hateHello":"Huh! It's you... What do you want?!",
   "tradeRequest":"It would be wise of you to accept my proposal.",

   "declaringWar":"The sharp-edged sword cuts through the void, and within the raging fire, a cool wind blows.",
   "attacked":"Watch out and be aware of my soldiers! I'll wait for the right moment to strike at you.",
   "defeated":"The summer grasses are all that remains of warriors' dreams.",

   "outerColor":[180,180,0],
   "innerColor":[0,0,0],

   "uniqueName":"The Han System",
   "uniques":["Gain [+1 Culture, +1 Science, and +2 Gold] for every [Roads] and [Railroads]"],
   "cities":["Matsudaira","Okazaki","Edō","Nikkō"],
},
{
              "name":"Takeda",
   "style":"Oriental",
   "leaderName":"Takeda Shingen",
   "adjectives":["Takeda Clan Member"],
   "startBias":["Hill"],
   "preferredVictoryType":"Domination",
   "favoredReligion":"Shinto",

   "startIntroPart1":"The winds of change are coming, oh Takeda Shingen, Head of Takeda clan and the Tiger of Kai. As one of the most and last powerful daimyos, with exceptional military prestige, you were adept at both domestic affairs and military leadership. You quickly conquered a number of the major warlords in the surrounding regions of Kai Province, and faced your fiercest rival, the Dragon of Echigo, Uesugi Kenshin on the battlefield five times, with both of you being a match for the other. You continued your conquests, but the structure of Japan was changing, with Oda Nobunaga and Tokugawa Ieyasu crushing their opponents. As the last daimyo who was powerful enough to stand against them, you led the de-facto anti-Oda alliance along with your twenty-four generals but died in camp before your project was complete.",
   "startIntroPart2":"Fierce Takeda Shingen, you have been given a second chance to fight; to fight against old rivals and new threats. You must lead your clan to victory, for otherwise, you will face certain destruction. Find another twenty-four generals and retake your place among the daimyo elite. Will you rebuff the advances of your enemies? Can you build a civilization that will stand the test of time?",

   "introduction":"You stand before Shingen, leader of the great Takeda clan. Under heaven and earth, I alone am feared.",
   "neutralHello":"Greetings, what brings you here?",
   "hateHello":"Oh, it's you!!! What brought you to me?!?!?!",
   "tradeRequest":"This proposal here is good, you might accept this if you're wise.",

   "declaringWar":"I will show you the might of the Takeda's army! Come and fight me.",
   "attacked":"Hah, then you should know that this Tiger will eat you alive!",
   "defeated":"Impossible, you have moved a mountain! Truly, you are a worthy opponent!",

   "outerColor":[180,0,0],
   "innerColor":[0,0,0],

   "uniqueName":"Tiger of Kai",
   "uniques":["Units requiring [Strategic Resources] provide [Golden Age Points] when trained, and by defeating enemy Units. During a Golden Age, enemy Cities passively take damage for each Takeda Unit within Movement range."],
   "cities":["Kofu","Yogaiyama","Kaizu","Hakusan","Yato","Shinpu","Fuse","Katsurayama","Uenohara","Saigawa","Hachimanbara","Shiozaki","Fukashi","Kirihara","Katsurao","Hayashi","Toishi","Iwadonoyama","Takato","Majino","Katsuyama","Misaka","Yamura","Suwahara","Fukushima","Takatenjin","Wakamiko","Kuwabara","Minowa","Fukuyo","Nagakubo","Ryugasaki","Furumiya","Noda","Matsuo","Kuragano","Matsuyama","Kanbara","Hanazawa"],
},
{
             "name":"Uesugi",
   "style":"Oriental",
   "leaderName":"Uesugi Kenshin",
   "adjectives":["Uesugi Clan Member"],
   "startBias":["Avoid [Desert]"],
   "preferredVictoryType":"Domination",
   "favoredReligion":"Shinto",

   "startIntroPart1":"The winds of change are coming, oh Uesugi Kenshin, Head of Uesugi and Nagao clans and the Dragon of Echigo. As one of the most and last powerful daimyos, with exceptional military prestige, you were adept at both domestic affairs and military leadership. You quickly conquered a number of the major warlords in the surrounding regions of Echigo Province, and faced your fiercest rival, the Tiger of Kai, Takeda Shingen, on the battlefield five times, with both of you being a match for the other. You continued your conquests, but the structure of Japan was changing, with Oda Nobunaga and Tokugawa Ieyasu crushing their opponents. But the daimyos were dying, leaving you one of the few who could stand against them, but, held up by bad weather, you died in camp before your project was complete.",
   "startIntroPart2":"Valiant Uesugi Kenshin, you have been given a second chance to fight; to fight against old rivals and new threats. You must lead your clan to victory, for otherwise, you will face certain destruction. Receive your blessings from Tamonten and retake your place among the daimyo elite. Will you repulse the spread of your enemies? Can you build a civilization that will stand the test of time?",

   "introduction":"This humble one is Kenshin, Lord of the Uesugi and Nagao. Our fates will be decided in the heavens, but our accomplishments will be decided on our feet.",
   "neutralHello":"Greetings, what brings you to Echigo?",
   "hateHello":"It seems you wanted to meet me. Tell me then, as I am not satisfied to meet you at all.",
   "tradeRequest":"This humble warrior will wish for the best for you if you're wise to accept this proposal.",

   "declaringWar":"It seems your ambitions are too high for me to tolerate. Prepare for war.",
   "attacked":"Your ambitions of war against us shows you are incompetent. Come and fight me, if you want to.",
   "defeated":"I know not what life is, nor death. Both Heaven and Hell are left behind; I stand in the moonlit dawn, Free from clouds of attachment.",

   "outerColor":[0,150,240],
   "innerColor":[0,0,0],

   "uniqueName":"Dragon of Echigo",
   "uniques":["Units defeated in or adjacent to your territory provide [Faith] regardless of their owner. Upon the outbreak of war, [Production] is rushed in the [Capital] equal to the amount of [Faith] in your reserves."],
   "cities":["Kasugayama","Yonezawa","Tochio","Sakado","Samegao","Iiyama","Fuse","Katsurayama","Uenohara","Saigawa","Hachimanbara","Shiozaki","Imaizumi","Sekidosan","Kitanosho","Iwaki","Nanao","Higashiyata","Arayama","Kabutoyama","Togi","Shoinkawashiri","Anamizu","Kumaki","Matsuto","Odawara","Masuyama","Sugiyama","Kawagoe","Moriyama","Iwatsuki","Yuyama","Hasunuma"],
},
{
             "name":"Hojo",
   "style":"Oriental",
   "leaderName":"Hojo Ujiyasu",
   "adjectives":["Hojo Clan Member"],
   "startBias":["Coast"],
   "preferredVictoryType":"Diplomatic",
   "favoredReligion":"Shinto",

   "startIntroPart1":"Salutations to you, Hojo Ujiyasu, head of the Later Hojo, the Lion of Sagami! You became the clan's head at the age of 26, beset on enemies by all sides, and with an old and ailing economic system. You would subsequently reform the economy of your lands in Kanto, rapidly becoming one of the wealthier powers in the region, and with your deft and cunning acquired your legendary moniker of Lion of Sagami through your might of arms, repeatedly scoring incredible victories, and becoming one of the most powerful daimyo of the entire Sengoku period.",
   "startIntroPart2":"Oh, noble Ujiyasu, your clan once again seeks glory and power as it is once more surrounded by foes at all corners. It is your powerful hand that must lead the Hojo clan once again to its primacy, and seize your place as the Lion of Sagami yet again. Can you rise above the circumstance like a dragonfly over a lake? Will you build a civilization that can stand the test of time?",

   "introduction":"Salutations to you, this humble fellow is Hojo Ujiyasu. Sit down, here in the lands of the Hojo, you are a guest.",
   "neutralHello":"Ah, it's you. What brings you here?",
   "hateHello":"Oh... What do you want from me?",
   "tradeRequest":"It would be great if you accept my proposal.",

   "declaringWar":"It seems war is inevitable, let's see your skills in battle.",
   "attacked":"Your aggression did not favor me at all, and a fatal one as well.",
   "defeated":"Curse you and your bloodline. May dragonflies fall wherever you walk.",

   "outerColor":[0,160,200],
   "innerColor":[0,0,0],

   "uniqueName":"Lion of Sagami",
   "uniques":["Enemy units in Hojo lands take damage whenever an enemy is killed. [+2 Gold] from [City Connections]."],
   "cities":["Odawara","Edo","Ashigara","Nirayama","Kamakura","Kawagoe","Kokokuji","Tamanawa","Misaki","Maebashi","Tsukui","Kawamura","Yamanaka","Nagahama","Shimoda","Fukusawa","Maruyama","Takiyama","Hachijoji","Setagaya","Hachigata","Kozukue","Kurihashi","Iwatsuki","Aoki","Oshi","Kasai","Matsuyama","Matsuida","Motosakura","Karasawayama","Sekiyado","Hirai","Usui","Oyama","Koga"],
},
{
           "name":"Chosokabe",
   "style":"Oriental",
   "leaderName":"Chosokabe Motochika",
   "adjectives":["Japanese"],
   "startBias":["None"],
   "preferredVictoryType":"Cultural",
   "favoredReligion":"Buddhism",

   "startIntroPart1":"Hail, Chosokabe Motochika, Chief of the Chosokabe Clan! Though your father called you 'Little Princess' in your youth, you were anything but a princess upon inheriting power. Quickly proving yourself in battle, you finished your father's work and turned on the Ichijo clan, gaining full control of Tosa province. Alas, Tosa's soil was poor and could not sustain your lands, and your battle prowess meant that by 1583, you controlled the entirety of Shikoku. Unfortunately, this rule did not last long, and though you fought valiantly against Hideyoshi's forces, you were forced to surrender all provinces except Tosa.",
   "startIntroPart2":"Lord Chosokabe, once again, you shake aside your moniker of Himewako. Once again, you take to the field to secure your people's future. Will you sweep aside all who stand before you? Can you build a civilization that will stand the test of time?",

   "introduction":"This is quite rare. A traveler in Shikoku? Welcome to Tosa. This humble one is Chosokabe Motochika.",
   "neutralHello":"It's you again! What brings you to Tosa once more?",
   "hateHello":"You... What do you want? Tell me now, I have no patience for you.",
   "tradeRequest":"Hey, is my proposal looks good to you?",

   "declaringWar":"I did not like your attitude upon Chosokabe domains, prepare for war!",
   "attacked":"How predictable, you are nothing more than a liar to me, Chosokabe Motochika!",
   "defeated":"I have no regrets other than to die in your hands, you showed me your leadership. Great work.",

   "outerColor":[100,250,0],
   "innerColor":[0,0,0],

   "uniqueName":"Hundred Article Code",
   "uniques":["Conquered cities provide a percentage of their [Food] to your Capital. Trade Routes to [Cities] with a Courthouse gain [+25]% [Food]."],
   "cities":["Oko","Hata","Aki","Nakamura","Urado","Kochi","Ichinomiya","Shozui","Ozu","Takao","Kaneko","Marugame","Takamatsu","Hiketa","Matsuyama","Uwajima","Nakatsu","Imabari","Awa","Iyo"],
},
  {
   "name":"Imagawa",
   "style":"Oriental",
   "leaderName":"Imagawa Yoshimoto",
   "adjectives":["Imagawa Clan Members"],
   "startBias":["None"],
   "preferredVictoryType":"Domination",
   "favoredReligion":"Buddhism",

   "startIntroPart1":"Greetings, great Imagawa Yoshimoto, lord of the Imagawa clan! You led one of the preeminent clans of the early Sengoku period, custodians of the rich and fertile Suruga and Totomi provinces. As daimyo, you quickly became a respected diplomat and administrator. Under your administration, your capital of Sunpu grew into a prosperous cultural hub approaching even the court of Kyoto in its grandeur. You were renowned for your success in mediating and resolving disputes among feudal lords, solving issues without bloodshed and forging powerful alliances with your neigbours. While you were not a renowned military commander in your own right, your powerful and loyal army, successful commanders, and success in swaying minor daimyos to your side allowed you significant success in your conquests, expanding your domain to Mikawa and parts of Owari. Truly, your rule saw the Imagawa reach a position of prestige and prosperity rarely achieved by a simple clan!",
   "startIntroPart2":"Oh great daimyo, your bold march to Kyoto led to your shocking defeat and untimely death, and the legacy of your clan and your rule has been eclipsed by the rise of your vanquisher. But your great leadership is once more recognised, and you have the opportunity to lead the Imagawa on a new path of ascendancy! Will you triumph over your foes, by the quill or by the blade, and emerge as a leader all can follow? Will you build a civilization to stand the test of time?",

   "introduction":"Hail! The humble Yoshimoto of the Imagawa clan greets you. Perhaps in this age of warfare, we are best off pursuing our interests together?",
   "neutralHello":"Look like we met again. What affairs do you have in mind?",
   "hateHello":"Look like you and I are met again once more. What do you want me to do, you useless trash?",
   "tradeRequest":"Think wisely and accept my proposal. It's good, I assure you so.",

   "declaringWar":"You are in our interests of taking over, try to stop me will be your greatest fatal mistake!",
   "attacked":"Oh hoh hoh... I see... Let's see who is better, you or me.",
   "defeated":"You have bested me. I can only hope I am remembered for my achievements and not my military failure.",

   "outerColor":[60,60,240],
   "innerColor":[0,0,0],

   "uniqueName":"The Great March to Kyoto",
   "uniques":["For the first [5] turns of a war, Units ignore enemy [Zone of Control] and may use enemy [Roads]. Capturing another Civilization's Capital transfers all their [Influence] with City-States to you."],
   "cities":["Sunpu","Hamamatsu","Shizuhatayama","Kakegawa","Mochifune","Tanaka","Kokokuji","Omiya","Mariko","Hanazawa","Ishiwaki","Katanokami","Hanakura","Yokoji","Takatenjin","Utsuyama","Inui","Futamata","Tobayama","Osakabe","Iinoya","Shizu","Kuno","Okazaki","Tahara","Yoshida","Ansho","Otaka","Kutsukake","Narumi"],
},
{
   "name":"Mori",
   "style":"Oriental",
   "leaderName":"Mori Motonari",
   "adjectives":["Mori Clan Member"],
   "startBias":["Coast"],
   "preferredVictoryType":"Domination",
   "favoredReligion":"Buddhism",

   "startIntroPart1":"Blessings of the divine be upon you, Lord Mori Motonari, great Daimyo and head of the ancient Mori Clan! The Mori descended from Oe Hiromoto of the Kamakura period, but it was under your stewardship that the clan truly came to prominence. When you came to power, Aki Province was threatened on all sides by the neighboring Ouchi, Amago and Takeda clans. Through your careful strategy and cunning diplomacy, you were able to turn the tables on each of your enemies in turn, culminating in your legendary battle against the Ouchi on the sacred isle of Miyajima. Your glorious victory set the stage for the rise of your family, with the Mori becoming one of the most important clans in Western Japan.",
   "startIntroPart2":"Lord Mori, your people yearn to know your next ambition! Will you carve out an empire by land and by sea? Will you raise the Mori name from obscurity into the annals of history? Can you build a civilization that will stand the test of time?",

   "introduction":"Greetings to you, fellow warrior. I am Mori Motonari, of Aki. What will history say of our meeting?",
   "neutralHello":"Welcome back. What brings you here?",
   "hateHello":"Oh, what do you want from me?",
   "tradeRequest":"I would like to see my proposal being fairly agreed upon. Be wise and you will see its fairness.",

   "declaringWar":"Your arrogance tells me of deception. I have no choice but to declare war on you.",
   "attacked":"How arrogant you are to declare war on me. Let's see who lasts longer.",
   "defeated":"Divided, and you will perish. Learn the lesson that I failed to understand.",

   "outerColor":[250,0,0],
   "innerColor":[0,0,0],

   "uniqueName":"The Three Arrows",
   "uniques":["Kills along a coastline yield [Faith] and damage adjacent enemy Units. Embarked [Great Prophets] may construct [Holy Sites] on [Coast] tiles."],
   "cities":["Yoshida-Koriyama","Suzuo","Tajihi-Sarugake","Miyao","Sakurao","Hinoyama","Niitakayama","Miiri-Takamatsu","Hagi","Kagamiyama","Goryu","Hiroshima","Katsura","Biwako","Mibu","Kimura","Funayama","Yagi","Nagamiyama","Koi","Tokonoyama","Mihara","Sato-Kanayama","Kusatsu","Hatagaeshiyama","Kannabe","Takayama","Kashirazaki","Kagi","Konomine","Shikano","Odaka","Noshima","Yamabuki","Shiraga","Gassantoda","Nukuyu","Mitoya","Akana","Tsuwano"],
},
{
   "name":"Shimazu",
   "style":"Oriental",
   "leaderName":"Shimazu Yoshihisa",
   "adjectives":["Shimazu Clan Member"],
   "startBias":["None"],
   "preferredVictoryType":"Scientific",
   "favoredReligion":"Buddhism",

   "startIntroPart1":"",
   "startIntroPart2":"",

   "introduction":"",
   "neutralHello":"",
   "hateHello":"",
   "tradeRequest":"",

   "declaringWar":"",
   "attacked":"",
   "defeated":"",

   "outerColor":[0,0,0],
   "innerColor":[0,0,0],

   "uniqueName":"",
   "uniques":[""],
   "cities":[],
},
//Minor Clans
//Ikko-ikki
//Others
]
